# NumDashStyles

## Description
Function NumDashStyles returns the number of available line dash patterns.

```pascal
FUNCTION NumDashStyles : INTEGER;
```

```python
def vs.NumDashStyles():
    return INTEGER
```

## Remarks
*\_c\_*, 2014.04.08:  It returns exclusively the count of dash styles ignoring complex line types, if any. Use BuildResourceList  instead if you need them.

## Examples
#### VectorScript ####
```pascal
numLS := NumDashStyles;
```
#### Python ####
```python

```

```pascal
resultN := NumDashStyles;
```
```python
result = vs.NumDashStyles()
```

## See Also
VS Functions:
BuildResourceList
| GetNameFromResourceList

## Version
Availability: from MiniCAD 4.0

## Category
* Document Attributes